# StructuralSectionGeneralR Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionGeneralR Class
Members See Also
---
Defines parameters for pipes.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class StructuralSectionGeneralR : StructuralSectionRound
```

Visual Basic
---
```text
Public Class StructuralSectionGeneralR _
	Inherits StructuralSectionRound
```

Visual C++
---
```text
public ref class StructuralSectionGeneralR : public StructuralSectionRound
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRound Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralR Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionPipeStandard Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRoundHSS
# See Also
StructuralSectionGeneralR Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace